In [362]:
import pandas as pd

# Create a dictionary with three keys, 'A', 'B', and 'C', and lists of 10 numbers as values
data = {'A': list(range(10)),
        'B': list(range(10, 20)),
        'C': list(range(20, 30))}

# Convert the dictionary to a pandas DataFrame
df1 = pd.DataFrame(data)

# Print the DataFrame
df = df1.head()
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [363]:
df.count()

A    5
B    5
C    5
dtype: int64

In [364]:
df.A.count()

5

In [365]:
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [366]:
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [367]:


# Create a new DataFrame with one row of data
new_row = pd.DataFrame([[0, 1, 2]], columns = df.columns)

# Use concat to append the new row to the original DataFrame
df = pd.concat([df, new_row], ignore_index=True)

In [368]:
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24
5  0   1   2

In [369]:
import pandas as pd

# # Assume this is your original DataFrame
# df = pd.DataFrame({
#     'A': [0, 1, 2],
#     'B': [10, 11, 12],
#     'C': [20, 21, 22]
# })

# Create a new DataFrame with one row of data
new_row = pd.DataFrame([[0, 1, 200]], columns = df.columns)

# Use concat to append the new row to the original DataFrame
df = pd.concat([df, new_row], ignore_index= False)

In [370]:
df

   A   B    C
0  0  10   20
1  1  11   21
2  2  12   22
3  3  13   23
4  4  14   24
5  0   1    2
0  0   1  200

In [371]:
# Create a new DataFrame with one row of data
new_row = pd.DataFrame([[0, 1, 300]], columns = df.columns)

# Use concat to append the new row to the original DataFrame
df = pd.concat([df, new_row], ignore_index= True)

In [372]:
df

   A   B    C
0  0  10   20
1  1  11   21
2  2  12   22
3  3  13   23
4  4  14   24
5  0   1    2
6  0   1  200
7  0   1  300

In [373]:
df = pd.concat([df, pd.DataFrame([['NULL', 'NULL', 'NULL']], columns = df.columns)], ignore_index=True)

In [374]:
df

      A     B     C
0     0    10    20
1     1    11    21
2     2    12    22
3     3    13    23
4     4    14    24
5     0     1     2
6     0     1   200
7     0     1   300
8  NULL  NULL  NULL

In [375]:
df = pd.concat([df, pd.DataFrame([[None, None, None]], columns = df.columns)], ignore_index=True)

In [376]:
df

      A     B     C
0     0    10    20
1     1    11    21
2     2    12    22
3     3    13    23
4     4    14    24
5     0     1     2
6     0     1   200
7     0     1   300
8  NULL  NULL  NULL
9  None  None  None

In [377]:
df.count()

A    9
B    9
C    9
dtype: int64

In [378]:
df.A.count()

9

In [381]:
df.A.size

10

In [379]:
df.A.value_counts()

0       4
1       1
2       1
3       1
4       1
NULL    1
Name: A, dtype: int64

In [382]:
df.B.value_counts()

1       3
10      1
11      1
12      1
13      1
14      1
NULL    1
Name: B, dtype: int64

In [383]:
df.C.value_counts()

20      1
21      1
22      1
23      1
24      1
2       1
200     1
300     1
NULL    1
Name: C, dtype: int64

In [384]:
df

      A     B     C
0     0    10    20
1     1    11    21
2     2    12    22
3     3    13    23
4     4    14    24
5     0     1     2
6     0     1   200
7     0     1   300
8  NULL  NULL  NULL
9  None  None  None

In [385]:
df.value_counts()

A     B     C
0     1     2       1
            200     1
            300     1
      10    20      1
1     11    21      1
2     12    22      1
3     13    23      1
4     14    24      1
NULL  NULL  NULL    1
dtype: int64

In [386]:
df.size

30

In [387]:
df.shape

(10, 3)

In [388]:
df

      A     B     C
0     0    10    20
1     1    11    21
2     2    12    22
3     3    13    23
4     4    14    24
5     0     1     2
6     0     1   200
7     0     1   300
8  NULL  NULL  NULL
9  None  None  None

In [389]:
df.A.value_counts()

0       4
1       1
2       1
3       1
4       1
NULL    1
Name: A, dtype: int64

In [390]:
df.groupby('A').count()

      B  C
A
0     4  4
1     1  1
2     1  1
3     1  1
4     1  1
NULL  1  1

In [391]:
df.A

0       0
1       1
2       2
3       3
4       4
5       0
6       0
7       0
8    NULL
9    None
Name: A, dtype: object

In [392]:
df.A.count()

9

In [393]:
df.A.nunique()

6

In [394]:
df.A.value_counts()

0       4
1       1
2       1
3       1
4       1
NULL    1
Name: A, dtype: int64

In [395]:
df

      A     B     C
0     0    10    20
1     1    11    21
2     2    12    22
3     3    13    23
4     4    14    24
5     0     1     2
6     0     1   200
7     0     1   300
8  NULL  NULL  NULL
9  None  None  None

In [396]:
df

      A     B     C
0     0    10    20
1     1    11    21
2     2    12    22
3     3    13    23
4     4    14    24
5     0     1     2
6     0     1   200
7     0     1   300
8  NULL  NULL  NULL
9  None  None  None

In [397]:
df

      A     B     C
0     0    10    20
1     1    11    21
2     2    12    22
3     3    13    23
4     4    14    24
5     0     1     2
6     0     1   200
7     0     1   300
8  NULL  NULL  NULL
9  None  None  None

In [398]:
df.groupby('A').size()

A
0       4
1       1
2       1
3       1
4       1
NULL    1
dtype: int64

In [399]:
df.groupby('A').count()

      B  C
A
0     4  4
1     1  1
2     1  1
3     1  1
4     1  1
NULL  1  1